0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    NozzleOutlet
    {
        type            fixedValue;
        value           uniform (0 -1000 0);
    }
    Ground
    {
        type            noSlip;
    }
    InviscidWall1
    {
        type            wedge;
    }
    InviscidWall2
    {
        type            wedge;
    }
    BagWall
    {
        type            noSlip;
    }
    FreeStream
    {
        type            zeroGradient;
    }
    RocketWall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
