0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 2000;

boundaryField
{
    NozzleOutlet
    {
        type            fixedValue;
        value           uniform 200000;
    }

    Ground
    {
        type            zeroGradient;
    }

    InviscidWall1
    {
        type            wedge;
    }
    InviscidWall2
    {
        type            wedge;
    }
    BagWall
    {
        type            zeroGradient;
    }
    FreeStream
    {
        type            waveTransmissive;
        gamma           1.4;
    }
    RocketWall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
